app/views/users/show.html.erb

<% if @user %>
<% SellPost.where(user: @user.id).find_each do |sell_post|%>
---
SELECT  "buy_posts".* FROM "buy_posts" WHERE "buy_posts"."user_id" = 2  ORDER BY "buy_posts"."id" ASC LIMIT 1000
SELECT  "sell_posts".* FROM "sell_posts" WHERE "sell_posts"."user_id" = 2  ORDER BY "sell_posts"."id" ASC LIMIT 1000