app/controllers/buy_posts_controller.rb

SELECT "buy_posts".* FROM "buy_posts"  ORDER BY "buy_posts"."price" ASC
---
	def index
		@buy_posts = BuyPost.order(:price)

INSERT INTO "buy_posts" ("name", "isbn", "price", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "HFJ"], ["isbn", "912391823"], ["price", 12], ["user_id", 1], ["created_at", "2016-04-14 01:59:39.411142"], ["updated_at", "2016-04-14 01:59:39.411142"]]
---
	def create
		@buy_post = BuyPost.new post_params
		@buy_post.user = current_user
		@buy_post.save

SELECT "buy_posts".* FROM "buy_posts" WHERE "buy_posts"."name" = ?  [["name", "912391823"]]
SELECT "buy_posts".* FROM "buy_posts" WHERE "buy_posts"."isbn" = ?  [["isbn", "912391823"]]
---
	def sort
		if BuyPost.where(name: params[:id]) != []
			@buy_posts = BuyPost.where(name: params[:id])
		else
			@buy_posts = BuyPost.where(isbn: params[:id])

SELECT  "buy_posts".* FROM "buy_posts" WHERE "buy_posts"."id" = ? LIMIT 1  [["id", 8]]
DELETE FROM "buy_posts" WHERE "buy_posts"."id" = ?  [["id", 8]]
---
	def destroy
        @buypost = BuyPost.find_by_id(params[:id])

        if @buypost.destroy