app/controllers/buy_posts_controller.rb

	def index
		@buy_posts = BuyPost.all
---
SELECT "buy_posts".* FROM "buy_posts"