app/controllers/sell_posts_controller.rb

    def index
        @sell_posts = SellPost.all
---
SELECT "sell_posts".* FROM "sell_posts"

    def create
        @sell_post = SellPost.new post_params
        @sell_post.user = current_user
        @sell_post.save
---
INSERT INTO "sell_posts" ("name", "isbn", "price", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "ABCDEFGH"], ["isbn", "1010"], ["price", 10], ["user_id", 2], ["created_at", "2016-04-14 03:28:00.258642"], ["updated_at", "2016-04-14 03:28:00.258642"]]

    def sort
        if SellPost.where(name: params[:id]) != []
            @sell_posts = SellPost.where(name: params[:id])
        else
            @sell_posts = SellPost.where(isbn: params[:id])
---
SELECT "sell_posts".* FROM "sell_posts" WHERE "sell_posts"."name" = ?  [["name", "1010"]]
SELECT "sell_posts".* FROM "sell_posts" WHERE "sell_posts"."isbn" = ?  [["isbn", "1010"]]

    def destroy
        @sellpost = SellPost.find_by_id(params[:id])

        if @sellpost.destroy
---
SELECT  "sell_posts".* FROM "sell_posts" WHERE "sell_posts"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "sell_posts" WHERE "sell_posts"."id" = ?  [["id", 3]]